Case/case10/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }
    ceiling
    {
        type            zeroGradient;
    }
    sWall
    {
        type            zeroGradient;
    }
    nWall
    {
        type            zeroGradient;
    }
    sideWalls
    {
        type            empty;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    inlet
    {
        type            zeroGradient;
    }
    glass1
    {
        type            zeroGradient;
    }
    glass2
    {
        type            zeroGradient;
    }
    sun
    {
        type            zeroGradient;
    }
    heatsource1
    {
        type            zeroGradient;
    }
    heatsource2
    {
        type            zeroGradient;
    }
    Table_master
    {
        type            zeroGradient;
    }
    Table_slave
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
